{
    "jobs": [
        {
            "id": "1",
            "jobTitle": "Accuracy Checking Pharmacy Technician (ACPT)",
            "department": "Online Doctor",
            "City": "Glasgow",
            "description": "ONLINE DOCTOR · GLASGOW\nAccuracy Checking Pharmacy Technician (ACPT)\nApply for this job\nWe have an opportunity for an Accuracy Checking Pharmacy Technician (ACPT) to Join our rapidly growing team at Simple Online Healthcare, at our automated medication assembly centre based in our state-of-the-art Glasgow premises.\nThis is an opportunity for someone who is passionate about patient centric care and who wants to be a part of a team that provides exceptional service. In this non-patient facing role, you will work in our uniquely set out dispensary, your overall responsibility will be to participate in the whole assembly process, carrying out quality control and assurance checks to ensure that products dispensed are of the appropriate quality.\nYou are a dedicated professional registered with the GPhC, ready to provide your membership number upon request. Holding an NVQ3 Pharmacy Technician and ACPT qualification, your resourcefulness and initiative shine through. You possess a keen ability to analyse challenges and formulate solutions efficiently, complemented by an impeccable attention to detail.\nFurthermore, your proven track record of managing and prioritising tasks, even under tight deadlines, sets you apart. We're excited to see what you can bring to our team.\nEssential Skills:\nPharmacy Technician Level 3 – ACPT qualification.\nAbility to follow and understand all relevant SOPs.\nStrong and accurate administrative skills.\nConfident and engaged in working with technology.\nSalary: up to £15.50p/h DOE\nHours: Monday – Friday 9:00am – 6:00pm\n\nBasics you can expect:\nRewarding bonus incentive scheme\n25 days holiday entitlement + Bank Holidays\nCompany pension scheme\nCompany share scheme\nEmployee discount scheme\nInternal progression opportunities\nBirthdays off!\nWellbeing policy\nOffice extras:\nFresh fruit delivered and available to everyone\nA free coffee machine\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions. Apply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant\nLW_logo_employer_rgb.jpg\nDepartment\nOnline Doctor\nLocations\nGlasgow\nPicture of Alan Creevy\nCONTACT\nAlan Creevy\nTalent Acquisition & People Lead – Recruitment & HR\nAbout Simple Online Healthcare\nFrom our beginnings in local community pharmacy, Simple Online Healthcare has grown to now have digital health services in the UK, Australia and Germany. Simple Online Pharmacy and Dr Felix in the UK, Simple Online Doctor in Australia, Kapsel in Germany.\nThe aim of each service is to make healthcare easily, accessible and simple for our patients.\nFounded in 2015\nCoworkers 96"
        },
        {
            "id": "2",
            "jobTitle": "Telehealth GP",
            "department": "Online Doctor",
            "City": "Brisbane",
            "description": "BRISBANE · FULLY REMOTE\nTelehealth GP\nApply for this job\nIn this new role, you will be at the forefront of digital healthcare, providing excellent and accessible patient care.\nYou will be providing digital consultations via video, telephone and assessment forms. The ability to provide an exceptional clinical experience for patients through digital mediums is essential. We require a forward-thinking GP, who can embrace different technologies and replicate a high level of clinical care online.\nYou will be working independently, making autonomous clinical decisions and implementing clinical guidelines and standards with support from our team.\nWho does this role suit?\nA problem solver who is proactive about implementing best practice\nEnjoy using technology, and embracing new and better ways to do things\nExcited about shaping how telehealth can be developed to serve patients\nAmbitious, hard-working doctor, who is excited about the role of telehealth in providing patients with a safe alternative to traditional GP appointments.\nLooking to further develop their expertise in digital healthcare\nRequirements:\nAHPRA Registration – General or Specialist GP\nExperience of working with an online health company\nOnline prescribing\nAble to learn and adopt new technologies to deliver excellent care\nValid medical indemnity insurance\nFull working rights in Australia\nExperience working in Australia\nBenefits:\nRemote work. Work from home, or a holiday apartment in the Whitsundays!\nUse telehealth to provide easily accessible healthcare to patients across Australia\nSalary:\n$175 p/h\nHours:\nLooking for flexibility Monday - Friday between the hours of 8am - 4pm\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions. Apply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant\nLocations\nBrisbane\nRemote status\nFully Remote\nPicture of Alan Creevy\nCONTACT\nAlan Creevy\nTalent Acquisition & People Lead – Recruitment & HR\nAbout Simple Online Healthcare\nFrom our beginnings in local community pharmacy, Simple Online Healthcare has grown to now have digital health services in the UK, Australia and Germany. Simple Online Pharmacy and Dr Felix in the UK, Simple Online Doctor in Australia, Kapsel in Germany.\nThe aim of each service is to make healthcare easily, accessible and simple for our patients.\nFounded in 2015\nCoworkers 96"
        },
        {
            "id": "3",
            "jobTitle": "Head of Design",
            "department": "Marketing",
            "City": "Glasgow",
            "description": "MARKETING · GLASGOW · HYBRID REMOTE\nHead of Design\nApply for this job\nHead of Design!\nWho We Are:\nDive into the world of digital health with us, a vibrant scale-up set on reshaping the very fabric of healthcare. Picture this: a world where healthcare is no longer complex, but simplified and patient-focused. That's the dream, and we're making it a reality, one pixel at a time. Are you ready to be part of this revolution?\nYour Canvas:\nImagine having the brush to paint our brand's visual story and the palette to craft engaging experiences across our platforms. As our Head of Design, your vision will lead our design trajectory, blending innovation and creativity seamlessly.\nWhat Awaits You:\nHarness your UI/UX prowess to execute user-centered designs based on real-life insights. With tools like Figma at your fingertips, craft interfaces that are not just appealing but intuitive. But that's just the beginning. Your flair for visual design will redefine our marketing narratives, giving voice to our brand in the most vivid and impactful ways.\nYour journey with us is bolstered by a track record of brilliance in UI/UX and graphic design. Showcase an impeccable portfolio that echoes your design journey, triumphs, and love for the craft.\nJoin Us:\nIf you've ever wanted to be at the heart of something transformative, to truly influence and drive design in a space that touches lives daily, here's your stage. Let's co-create a future where design meets healthcare in the most inspiring way!\nBasics you can expect:\nRewarding bonus incentive scheme\n25 days holiday entitlement + Bank Holiday\nCompany pension scheme\nCompany share scheme\nEmployee discount scheme\nInternal progression opportunities\nBirthdays off!\nWellbeing policy\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions. Apply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful user experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant\nLW_logo_employer_rgb.jpg\nDepartment\nMarketing\nLocations\nGlasgow\nRemote status\nHybrid Remote\nPicture of Alan Creevy\nCONTACT\nAlan Creevy\nTalent Acquisition & People Lead – Recruitment & HR\nCurrent job openings\nCRM Manager\nMarketing · Glasgow · Fully Remote\nAbout Simple Online Healthcare\nFrom our beginnings in local community pharmacy, Simple Online Healthcare has grown to now have digital health services in the UK, Australia and Germany. Simple Online Pharmacy and Dr Felix in the UK, Simple Online Doctor in Australia, Kapsel in Germany.\nThe aim of each service is to make healthcare easily, accessible and simple for our patients.\nFounded in 2015\nCoworkers 96"
        },
        {
            "id": "4",
            "jobTitle": "PHP Software Engineer",
            "department": "Software Engineering",
            "City": "Glasgow",
            "description": "SOFTWARE ENGINEERING · GLASGOW · FULLY REMOTE\nPHP Software Engineer\nApply for this job\nAre you a PHP software engineer looking to make a real difference?\nDo you want to use your skills to help create more accessible and affordable health solutions?\nIf so, we have an exciting opportunity for you at Simple Online Healthcare.\nIn the role of a PHP Software Engineer, you will be a key contributor in driving the development of an enterprise software solution, using modern approaches to web application development. You will help establish, reinforce, and evaluate coding standards, and share your knowledge with others across teams and communities. Your ability to collaborate, build consensus, and articulate your opinions will greatly impact our success as a team and the solutions we provide to our patients.\nNot only will you have a significant role in shaping our software solutions, but you will also have opportunities to mentor other developers, identify process issues, and propose changes to increase team efficiency and increase knowledge through AWS certifications. This position offers you a platform to express your creativity, expand your skills, and make a genuine difference in people’s lives.\nIn this role, you will gain exposure to a range of technologies. We use AWS extensively, with our most recent APIs deploying to Amazon ECS. The applications are built using Laravel on PHP 8.1. We also maintain many internal and open source packages to re-use throughout our apps via Composer. You will have the chance to deepen your understanding of code versioning tools like Git and learn about API documentation and security compliance.\nBasics you can expect:\nRewarding bonus incentive scheme\n25 days holiday entitlement + Bank Holidays\nCompany pension scheme\nCompany share scheme\nEmployee discount scheme\nInternal progression opportunities\nBirthdays off!\nWellbeing policy\nRemote role\nAWS Certifications\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions. Apply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful user experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant"
        },
        {
            "id": "5",
            "jobTitle": "React Native Software Engineer",
            "department": "Software Engineering",
            "City": "Glasgow",
            "description": "SOFTWARE ENGINEERING · GLASGOW · FULLY REMOTE\nReact Native Software Engineer\nApply for this job\nAre you a talented React Native Software Engineer with a passion for creating engaging user experiences?\nDo you have a knack for JavaScript, an eye for design, and a commitment to code quality?\nIf so, we invite you to join us at Simple Online Healthcare on our exciting journey to create affordable health solutions.\nAs our React Native Software Engineer, you'll be the primary driver in developing an engaging user experience for our mobile applications. But that's not all. Your role is pivotal in establishing and reinforcing our coding standards, engaging in constant knowledge sharing, and collaborating with back-end teams to integrate with existing and future APIs.\nWhat sets us apart?\nWe are a growing digital health services spread across the UK, Australia, and Germany, all committed to one goal: making healthcare easily accessible and simple for our patients. You will have the opportunity to impact the lives of countless individuals, making a difference in the healthcare sector.\nYou will have experience working with React Native in production, a deep understanding of JavaScript and its ecosystem, and a passion for user experience, then you could be the perfect fit for our team. We're looking for someone who is not only well-versed in HTML, CSS, and JavaScript, but also has experience with Tailwind CSS and a test-centric approach to development. If you're passionate about the overlap between data and UI and have a constant desire to further develop your skillset, we'd love to hear from you.\nBut what's in it for you?\nAt Simple Online Healthcare, we believe in the power of our team. You'll have the chance to mentor other developers, identify process issues, and propose changes that ensure the team is working as efficiently as possible. Your ideas will matter, and your voice will be heard.\nJoin us if you're passionate about helping make lives easier and understand how to collaborate, build consensus, and express your opinions constructively. This is not just a job, it's an opportunity to be part of a mission that matters, in a company that values your contributions. \nBasics you can expect:\nRewarding bonus incentive scheme\n25 days holiday entitlement + Bank Holiday\nCompany pension scheme\nCompany share scheme\nEmployee discount scheme\nInternal progression opportunities\nBirthdays off!\nWellbeing policy\nRemote working\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions. Apply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful user experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant"
        },
        {
            "id": "6",
            "jobTitle": "CRM Manager",
            "department": "Marketing",
            "City": "Glasgow",
            "description": "MARKETING · GLASGOW · FULLY REMOTE\nCRM Manager\nApply for this job\nReady to Lead in CRM? Join Simple Online Healthcare and Make an Impact!\nSalary:\n£40,000 - £55,000 DOE\nAt Simple Online Healthcare, we believe in more than just messaging. We're on a mission to redefine customer communication, and we're looking for our next Senior CRM Manager to champion this vision.\nYour role goes beyond traditional campaign management. Here, you'll craft compelling communication strategies that resonate, spanning channels from email to SMS to push notifications. Dive into rich customer data, identifying patterns and insights that drive targeted and effective campaigns.\nAre you familiar with tools like MailChimp, Klaviyo, or Mailjet? Great! You'll be deploying them to design and deliver campaigns that don't just reach inboxes but engage minds. Continual improvement is key, so you'll employ A/B tests to refine our approach and amplify results.\nLoyalty is golden in our books. Your expertise will help shape a customer loyalty program that not only retains but delights, enhancing the lifetime bond with our brand.\nAnd because the marketing world never stands still, you'll stay ahead. Keep us updated, informed, and primed to harness the latest trends and best practices in the CRM space.\nWhat we're looking for:\nProven experience in email and SMS communication.\nProficiency with CRM platforms like Mail Chimp or Klaviyo.\nA knack for crafting and managing B2C loyalty programs.\nIf you're passionate about elevating customer experiences and making a tangible difference in the CRM space, Simple Online Healthcare is where you need to be.\nBenefits and Perks:\nPaid birthday off to celebrate your special day.\nCompany shares scheme to participate in the company's growth.\nGenerous annual leave allowance of 33 days per year.\nEmployee discount platform for various products and services.\nAccess to an employee assistance platform to support personal and professional well-being.\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions.\nApply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful user experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant"
        },
        {
            "id": "7",
            "jobTitle": "Pharmacist",
            "department": "Dispensary",
            "City": "Carlisle",
            "description": "DISPENSARY CARLISLE Pharmacist\nApply for this job\nJob Summary:\nWe are seeking a highly motivated and skilled pharmacist to join our dynamic team as a Pharmacist based in our Carlisle hub. This non-patient facing position will be based at our new bespoke distance selling pharmacy, where you will play a crucial role in providing pharmaceutical services through our online platform. As an on-site pharmacist, you will work closely with our digital team to ensure the safe and efficient dispensing of prescriptions and medication advice to our valued customers. This is a full-time position, requiring 40 hours of work per week from Monday to Friday.\nKey Responsibilities:\nClinically checking prescriptions\nEnsure strict adherence to legal and ethical standards in pharmaceutical practice.\nCollaborate with other team members to maintain a smooth workflow and deliver excellent customer service.\nParticipate in continuous professional development to stay updated with the latest pharmaceutical developments and regulations.\nQualifications and Skills:\nRegistered pharmacist with the General Pharmaceutical Council (GPhC) in the UK.\nStrong attention to detail and accuracy in clinical checks.\nExcellent communication skills, both written and verbal, to provide clear and concise advice to customers.\nFamiliarity with digital platforms and technologies.\nAbility to work independently and as part of a team.\nDemonstrated commitment to ethical pharmaceutical practice and patient safety.\nBenefits and Perks:\nCompetitive salary and an excellent benefits package.\nPaid birthday off to celebrate your special day.\nCompany shares scheme to participate in the company's growth.\nGenerous annual leave allowance of 33 days per year.\nEmployee discount platform for various products and services.\nAccess to an employee assistance platform to support personal and professional well-being.\nFull extensive training provided to ensure you are equipped with the necessary skills and knowledge for the role.\nIf you are a pharmacist looking for an exciting opportunity to contribute to a cutting-edge distance selling pharmacy in the online space, we encourage you to apply and become a valuable member of our team. Together, we aim to revolutionise pharmaceutical services and deliver outstanding care to our customers across the UK.\nThe Simple Online Healthcare Promise:\nFounded in 2015, we started off as a small pharmacy with big dreams. Today, we are trusted by over 1000 patients per day, making sure they receive their medication safely and on time. We're always on the lookout for talent. If you're passionate about helping make lives easier, we'd love to hear from you.\nJoin us on our journey to create affordable health solutions.\nApply today to be part of a team that values growth, collaboration, and the simplification of healthcare. Your journey towards creating impactful user experiences in the healthcare industry starts here.\nReady to make a difference? Apply now!\nSimple Online Healthcare is proud to be an Equal Opportunity Employer.\nWe are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant"
        }
    ]
}
